wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_syscfg.c
/*!
    \brief      set Ethercat rmii0 mode tx_shift and rmii_shift (API_ID(0x0010U))
    \param[in]  txshift0
                only one parameter can be selected which is shown as below:
      \arg        ESC_RMII0_TXSHIFT0_0NS: rmii0 txshift value is 0ns
      \arg        ESC_RMII0_TXSHIFT0_10NS: rmii0 txshift value is 10ns
      \arg        ESC_RMII0_TXSHIFT0_20NS: rmii0 txshift value is 20ns
      \arg        ESC_RMII0_TXSHIFT0_30NS: rmii0 txshift value is 30ns
    \param[in]  rmii_shift0
                only one parameter can be selected which is shown as below:
      \arg        ESC_RMII0_SHIFT0_0: rmii0 phase compensation value is 0ns
      \arg        ESC_RMII0_SHIFT0_1: rmii0 phase compensation value is 2.5ns
      \arg        ESC_RMII0_SHIFT0_2: rmii0 phase compensation value is 5ns
      \arg        ESC_RMII0_SHIFT0_3: rmii0 phase compensation value is 7.5ns
      \arg        ESC_RMII0_SHIFT0_4: rmii0 phase compensation value is 10ns
      \arg        ESC_RMII0_SHIFT0_5: rmii0 phase compensation value is 12.5ns
      \arg        ESC_RMII0_SHIFT0_6: rmii0 phase compensation value is 15ns
      \arg        ESC_RMII0_SHIFT0_7: rmii0 phase compensation value is 17.5ns
    \param[out] none
    \retval     none
*/
void syscfg_esc_rmii0_mode_shift_set(uint32_t txshift0, uint32_t rmii0_shift0)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_RMIITX_S0_VAL | SYSCFG_ESCCFG0_RMII_S0);
    SYSCFG_ESCCFG0 |= (txshift0 & SYSCFG_ESCCFG0_RMIITX_S0_VAL) | (rmii0_shift0 & SYSCFG_ESCCFG0_RMII_S0);
}

/*!
    \brief      set Ethercat rmii1 mode tx_shift and rmii_shift (API_ID(0x0011U))
    \param[in]  txshift1
                only one parameter can be selected which is shown as below:
      \arg        ESC_RMII1_TXSHIFT1_0NS: rmii1 txshift value is 0ns
      \arg        ESC_RMII1_TXSHIFT1_10NS: rmii1 txshift value is 10ns
      \arg        ESC_RMII1_TXSHIFT1_20NS: rmii1 txshift value is 20ns
      \arg        ESC_RMII1_TXSHIFT1_30NS: rmii1 txshift value is 30ns
    \param[in]  rmii_shift1
                only one parameter can be selected which is shown as below:
      \arg        ESC_RMII1_SHIFT1_0: rmii1 phase compensation value is 0ns
      \arg        ESC_RMII1_SHIFT1_1: rmii1 phase compensation value is 2.5ns
      \arg        ESC_RMII1_SHIFT1_2: rmii1 phase compensation value is 5ns
      \arg        ESC_RMII1_SHIFT1_3: rmii1 phase compensation value is 7.5ns
      \arg        ESC_RMII1_SHIFT1_4: rmii1 phase compensation value is 10ns
      \arg        ESC_RMII1_SHIFT1_5: rmii1 phase compensation value is 12.5ns
      \arg        ESC_RMII1_SHIFT1_6: rmii1 phase compensation value is 15ns
      \arg        ESC_RMII1_SHIFT1_7: rmii1 phase compensation value is 17.5ns
    \param[out] none
    \retval     none
*/
void syscfg_esc_rmii1_mode_shift_set(uint32_t txshift1, uint32_t rmii1_shift1)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_RMIITX_S1_VAL | SYSCFG_ESCCFG0_RMII_S1);
    SYSCFG_ESCCFG0 |= (txshift1 & SYSCFG_ESCCFG0_RMIITX_S1_VAL) | (rmii1_shift1 & SYSCFG_ESCCFG0_RMII_S1);
}

/*!
    \brief      select Ethercat linkactled output polarity (API_ID(0x0012U))
    \param[in]  linkactled0
                only one parameter can be selected which is shown as below:
      \arg        ESC_LINKACTLED0_POL_LOW: EtherCat linkactled0 output 0
      \arg        ESC_LINKACTLED0_POL_HIGH: EtherCat linkactled0 output 1
    \param[in]  linkactled1
                only one parameter can be selected which is shown as below:
      \arg        ESC_LINKACTLED1_POL_LOW: EtherCat linkactled1 output 0
      \arg        ESC_LINKACTLED1_POL_HIGH: EtherCat linkactled1 output 1
    \param[in]  linkactled2
                only one parameter can be selected which is shown as below:
      \arg        ESC_LINKACTLED2_POL_LOW: EtherCat linkactled2 output 0
      \arg        ESC_LINKACTLED2_POL_HIGH: EtherCat linkactled2 output 1
    \param[out] none
    \retval     none
*/
void syscfg_esc_linkactled_pol_sel(uint32_t linkactled0, uint32_t linkactled1, uint32_t linkactled2)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_LINKACTLED0_POLSEL | SYSCFG_ESCCFG0_LINKACTLED1_POLSEL | SYSCFG_ESCCFG0_LINKACTLED2_POLSEL);
    SYSCFG_ESCCFG0 |= (linkactled0 | linkactled1 | linkactled2) & SYSCFG_LINKACT_POLSEL_MASK;
}

/*!
    \brief      select Ethercat lederr output polarity (API_ID(0x0013U))
    \param[in]  lederr
                only one parameter can be selected which is shown as below:
      \arg        ESC_LEDERR_POL_LOW: EtherCat lederr output 0
      \arg        ESC_LEDERR_POL_HIGH: EtherCat lederr output 1
    \param[out] none
    \retval     none
*/
void syscfg_esc_lederr_pol_sel(uint32_t lederr)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_LEDERR_POLSEL);
    SYSCFG_ESCCFG0 |= lederr & SYSCFG_ESCCFG0_LEDERR_POLSEL;
}

/*!
    \brief      select Ethercat ledrun output polarity (API_ID(0x0014U))
    \param[in]  ledrun
                only one parameter can be selected which is shown as below:
      \arg        ESC_LEDRUN_POL_LOW: EtherCat ledrun output 0
      \arg        ESC_LEDRUN_POL_HIGH: EtherCat ledrun output 1
    \param[out] none
    \retval     none
*/
void syscfg_esc_ledrun_pol_sel(uint32_t ledrun)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_LEDRUN_POLSEL);
    SYSCFG_ESCCFG0 |= ledrun & SYSCFG_ESCCFG0_LEDRUN_POLSEL;
}

/*!
    \brief      set Ethercat reset_out output polarity and count of clock cycles (API_ID(0x0015U))
    \param[in]  rstout_pol
                only one parameter can be selected which is shown as below:
      \arg        ESC_RSTOUT_POL_HIGH: EtherCat reset_out output 1
      \arg        ESC_RSTOUT_POL_LOW: EtherCat reset_out output 0
    \param[in]  rstout_cnt: 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void syscfg_esc_resetout_set(uint32_t rstout_pol, uint32_t rstout_cnt)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_RSTOUT_POLSEL);
    SYSCFG_ESCCFG0 |= rstout_pol & SYSCFG_ESCCFG0_RSTOUT_POLSEL;

    SYSCFG_ESCCFG2 = rstout_cnt;
}

/*!
    \brief      select Ethercat linkactled output polarity (API_ID(0x0016U))
    \param[in]  link0
                only one parameter can be selected which is shown as below:
      \arg        ESC_LINK0_POL_HIGH: EtherCat LINK0 output 1
      \arg        ESC_LINK0_POL_LOW: EtherCat LINK0 output 0
    \param[in]  link1
                only one parameter can be selected which is shown as below:
      \arg        ESC_LINK1_POL_HIGH: EtherCat LINK1 output 1
      \arg        ESC_LINK1_POL_LOW: EtherCat LINK1 output 0
    \param[in]  link2
                only one parameter can be selected which is shown as below:
      \arg        ESC_LINK2_POL_HIGH: EtherCat LINK2 output 1
      \arg        ESC_LINK2_POL_LOW: EtherCat LINK1 output 0
    \param[out] none
    \retval     none
*/
void syscfg_esc_link_pol_sel(uint32_t link0, uint32_t link1, uint32_t link2)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_NLINK0_POLSEL | SYSCFG_ESCCFG0_NLINK1_POLSEL | SYSCFG_ESCCFG0_NLINK2_POLSEL);
    SYSCFG_ESCCFG0 |= (link0 | link1 | link2) & SYSCFG_NLINK_POLSEL_MASK;
}

/*!
    \brief      select Ethercat mii or rmii (API_ID(0x0017U))
    \param[in]  mii_rmii_sel
                only one parameter can be selected which is shown as below:
      \arg        ESC_MII: ESC MII
      \arg        ESC_RMII: ESC RMII
    \param[out] none
    \retval     none
*/
void syscfg_esc_mii_rmii_sel(uint32_t mii_rmii_sel)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_RMIIEN);
    SYSCFG_ESCCFG0 |= mii_rmii_sel & SYSCFG_ESCCFG0_RMIIEN;
}

/*!
    \brief      configure Ethercat SMPS_DRIVE's drive capability (API_ID(0x0018U))
    \param[in]  drive_cap: drive capability
                only one parameter can be selected which is shown as below:
      \arg        ESC_SMPS_DRIVE_CAP_NORMAL: Drive capability is normal
      \arg        ESC_SMPS_DRIVE_CAP_REDUCED: Drive capability is reduced
    \param[out] none
    \retval     none
*/
void syscfg_esc_smps_drive_config(uint32_t drive_cap)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_SMPS_DRIVE);
    SYSCFG_ESCCFG0 |= drive_cap & SYSCFG_ESCCFG0_SMPS_DRIVE;
}

/*!
    \brief      set Ethercat port0 phy address offset (API_ID(0x0019U))
    \param[in]  phyadd_offset_sel
                only one parameter can be selected which is shown as below:
      \arg        ESC_PHY_ADDRESS_OFFSET_0: port0 phy address offset is 0
      \arg        ESC_PHY_ADDRESS_OFFSET_16: port0 phy address offset is 16
    \param[in]  offset_value: 0~31
    \param[out] none
    \retval     none
*/
void syscfg_esc_phyaddress_offset_set(uint32_t phyadd_offset_sel, uint32_t offset_value)
{
    SYSCFG_ESCCFG0 &= ~(SYSCFG_ESCCFG0_PHY_OFFSETSEL | SYSCFG_ESCCFG0_PHY_OFFSET);
    SYSCFG_ESCCFG0 |= (phyadd_offset_sel & SYSCFG_ESCCFG0_PHY_OFFSETSEL) | PHY_ADDRESS_OFFSET(offset_value & SYSCFG_PHY_OFFSET_MASK);
}

/*!
    \brief    configure the I/O compensation cell (API_ID(0x001AU))
    \param[in]  syscfg_cps: specifies the I/O compensation cell mode
                only one parameter can be selected which is shown as below:
      \arg        SYSCFG_IO_COMPENSATION_ENABLE: I/O compensation cell is enabled
      \arg        SYSCFG_IO_COMPENSATION_DISABLE: I/O compensation cell is disabled
    \param[out] none
    \retval     none
*/
void syscfg_io_compensation_config(uint32_t syscfg_cps)
{
    uint32_t reg;

    reg = SYSCFG_CPSCTL;
    /* reset the SYSCFG_CPSCTL_CPS_EN bit and set according to syscfg_compensation */
    reg &= ~SYSCFG_CPSCTL_CPS_EN;
    SYSCFG_CPSCTL = (reg | (syscfg_cps & SYSCFG_CPSCTL_CPS_EN));
}

/*!
    \brief      get bus timeout flag status (API_ID(0x001BU))
    \param[in]  flag: Bus Timeout flags
                only one parameter can be selected which is shown as below:
      \arg        SYSCFG_BUSTOSTAT_SDIO0BUSTOF: SDIO0 BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_CPUBUSTOF: CPU BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_TLIBUSTOF: TLI BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_MDMABUSTOF: MDMA BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_IPABUSTOF: IPA BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_CPUAHBPBUSTOF: CPU AHBP BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_DMA0MEMBUSTOF: DMA0 mem BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_DMA0PERIPHBUSTOF: DMA0 per BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_DMA1MEMBUSTOF: DMA1 mem BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_DMA1PERIPHBUSTOF: DMA1 per BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_ENET0BUSTOF: ENET0 BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_ENET1BUSTOF: ENET1 BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_SDIO1BUSTOF: SDIO1 BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_USBHS0BUSTOF: USBHS0 BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_USBHS1BUSTOF: USBHS1 BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_FFTBUSTOF: FFT BUS Timeout flag
      \arg        SYSCFG_BUSTOSTAT_ESCBUSTOF: ETHERCAT BUS Timeout flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus syscfg_bus_timeout_flag_get(uint32_t flag)
{
    FlagStatus retval = RESET;
    if(RESET != (SYSCFG_BUSTOSTAT & flag)) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      enable I/O speed optimization, high-speed at low-voltage (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_io_low_voltage_speed_optimization_enable(void)
{
    SYSCFG_CPSCTL |= SYSCFG_CPSCTL_IOSPDOP;
}

/*!
    \brief      disable I/O speed optimization, high-speed at low-voltage (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void syscfg_io_low_voltage_speed_optimization_disable(void)
{
    SYSCFG_CPSCTL &= ~SYSCFG_CPSCTL_IOSPDOP;
}

/*!
    \brief      set P/N MOS compensation value (API_ID(0x001EU))
    \param[in]  mos
                only one parameter can be selected which is shown as below:
      \arg        NMOS_COMPENSATION: NMOS
      \arg        PMOS_COMPENSATION: PMOS
    \param[in]  code: P/N MOS compensation value
    \param[out] none
    \retval     none
*/
void syscfg_pnmos_compensation_code_set(uint32_t mos, uint32_t code)
{
    uint32_t value;
    value = SYSCFG_CPSCCCFG;
    if(NMOS_COMPENSATION == mos) {
        /* configure NMOS compensation */
        value &= ~SYSCFG_CPSCCCFG_NCPSCC;
        value |= (code & SYSCFG_MOS_COMPENSATION_MASK);
    } else {
        /* configure PMOS compensation */
        value &= ~SYSCFG_CPSCCCFG_PCPSCC;
        value |= ((code & SYSCFG_MOS_COMPENSATION_MASK) << 4U);
    }
    SYSCFG_CPSCCCFG = value;
}

/*!
    \brief      set secure SRAM size (API_ID(0x001FU))
    \param[in]  SRAM size
                only one parameter can be selected which is shown as below:
      \arg        SECURE_SRAM_SIZE_0KB: secure SRAM size is 0KB
      \arg        SECURE_SRAM_SIZE_32KB: secure SRAM size is 32KB
      \arg        SECURE_SRAM_SIZE_64KB: secure SRAM size is 64KB
      \arg        SECURE_SRAM_SIZE_128KB: secure SRAM size is 128KB
    \param[out] none
    \retval     none
*/
void syscfg_secure_sram_size_set(uint32_t size)
{
    SYSCFG_SRAMCFG0 &= (uint32_t)(~SYSCFG_SRAMCFG0_SECURE_SRAM_SIZE);
    SYSCFG_SRAMCFG0 |= size & SYSCFG_SRAMCFG0_SECURE_SRAM_SIZE;
}

/*!
    \brief      get secure SRAM size (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     SRAM size
      \arg        SECURE_SRAM_SIZE_0KB: secure SRAM size is 0KB
      \arg        SECURE_SRAM_SIZE_32KB: secure SRAM size is 32KB
      \arg        SECURE_SRAM_SIZE_64KB: secure SRAM size is 64KB
      \arg        SECURE_SRAM_SIZE_128KB: secure SRAM size is 128KB
*/
uint32_t syscfg_secure_sram_size_get(void)
{
    return (SYSCFG_SRAMCFG0 & SYSCFG_SRAMCFG0_SECURE_SRAM_SIZE);
}

/*!
    \brief      get BOOT mode (API_ID(0x0021U))
    \param[in]  none
    \param[out] none
    \retval     boot mode
      \arg        BOOT_SRAM: BOOT from SRAM (ITCM/DTCM/RAM shared/AXI SRAM)
      \arg        BOOT_SECURITY: BOOT from Security
      \arg        BOOT_SYSTEM: BOOT_SYS (BootLoader)
      \arg        BOOT_USER_FLASH: BOOT_USER (User flash OSPI0/1)
*/
uint32_t syscfg_bootmode_get(void)
{
    return ((SYSCFG_USERCFG & SYSCFG_USERCFG_BOOT_MODE) >> 4U);
}

/*!
    \brief      enable SYSCFG interrupt (API_ID(0x0022U))
    \param[in]  interrupt
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_INT_INEXACT: inexact interrupt
      \arg        SYSCFG_INT_INPUT_ABNORMAL: input abnormal interrupt
      \arg        SYSCFG_INT_OVERFLOW: overflow interrupt
      \arg        SYSCFG_INT_UNDERFLOW: underflow interrupt
      \arg        SYSCFG_INT_DIV0: divide-by-zero interrupt
      \arg        SYSCFG_INT_INVALID_OPERATION: invalid operation interrupt
      \arg        SYSCFG_INT_CPU_DCDET: CPU ICACHE error detection information interrupt
      \arg        SYSCFG_INT_CPU_ICDET: CPU DCACHE error bank information interrupt
    \param[out] none
    \retval     none
*/
void syscfg_interrupt_enable(uint32_t interrupt)
{
    SYSCFG_CFPUINTEN |= interrupt;
}

/*!
    \brief      disable SYSCFG interrupt (API_ID(0x0023U))
    \param[in]  interrupt
                one or more parameters can be selected which are shown as below:
      \arg        SYSCFG_INT_INEXACT: inexact interrupt
      \arg        SYSCFG_INT_INPUT_ABNORMAL: input abnormal interrupt
      \arg        SYSCFG_INT_OVERFLOW: overflow interrupt
      \arg        SYSCFG_INT_UNDERFLOW: underflow interrupt
      \arg        SYSCFG_INT_DIV0: divide-by-zero interrupt
      \arg        SYSCFG_INT_INVALID_OPERATION: invalid operation interrupt
      \arg        SYSCFG_INT_CPU_DCDET: CPU ICACHE error detection information interrupt
      \arg        SYSCFG_INT_CPU_ICDET: CPU DCACHE error bank information interrupt
    \param[out] none
    \retval     none
*/
void syscfg_interrupt_disable(uint32_t interrupt)
{
    SYSCFG_CFPUINTEN &= (uint32_t)(~interrupt);
}

/*!
    \brief      get compensation cell flags (API_ID(0x0024U))
    \param[in]  cps_flag: compensation flag
      \arg        SYSCFG_FLAG_IO_LOW_VOLTAGE: I/O in low voltage state flag, product supply voltage is working below 2.5V
      \arg        SYSCFG_FLAG_COMPENSATION_READY: I/O compensation cell ready flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus syscfg_compensation_flag_get(uint32_t cps_flag)
{
    FlagStatus retval = RESET;
    if(SYSCFG_CPSCTL & cps_flag) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      get the ICACHE or DCACHE detection and error information (API_ID(0x0025U))
    \param[in]  cache:
                only one parameter can be selected which is shown as below:
      \arg        ICACHE_STATUS: select ICACHE
      \arg        DCACHE_STATUS: select DCACHE
    \param[in]  status:
                only one parameter can be selected which is shown as below:
      \arg        CPU_CACHE_ERROR_DETECTION: select detection information
      \arg        CPU_CACHE_ERROR_BANK: select error information
    \param[out] none
    \retval     value
*/
uint32_t syscfg_cpu_cache_status_get(uint32_t cache, uint32_t status)
{
    uint32_t value = 0U;
    switch(cache) {
    /* get ICACHE information */
    case ICACHE_STATUS:
        if(CPU_CACHE_ERROR_DETECTION == status) {
            /* return detection information */
            value = (uint32_t)((SYSCFG_CPUICAC & SYSCFG_CPUICAC_CPU_ICDET) >> 28U);
        } else {
            /* return error bank information */
            value = (uint32_t)((SYSCFG_CPUICAC & SYSCFG_CPUICAC_CPU_ICERR) >> 6U);
        }
        break;
    /* get DCACHE information */
    case DCACHE_STATUS:
        if(CPU_CACHE_ERROR_DETECTION == status) {
            /* return detection information */
            value = (uint32_t)((SYSCFG_CPUDCAC & SYSCFG_CPUDCAC_CPU_DCDET) >> 28U);
        } else {
            /* return error bank information */
            value = (uint32_t)((SYSCFG_CPUDCAC & SYSCFG_CPUDCAC_CPU_DCERR) >> 6U);
        }
        break;
    default:
        break;
    }
    return value;
}

/*!
    \brief      get brownout reset threshold level (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     BOR level
      \arg        BOR_OFF: no BOR function
      \arg        BOR_THRESHOLD_VAL1: BOR threshold value 1
      \arg        BOR_THRESHOLD_VAL2: BOR threshold value 2
      \arg        BOR_THRESHOLD_VAL3: BOR threshold value 3
*/
uint32_t syscfg_brownout_reset_threshold_level_get(void)
{
    return (SYSCFG_USERCFG & SYSCFG_USERCFG_BOR_TH);
}
